<!DOCTYPE html>
	<head>
	    <meta http-equiv=Content-Type content="text/html;charset=UTF-8">
	    <title>Курс PHP1</title>
		<style>
			.title {
				font-size: 18px;
				font-weight: bold;
			}
			.description {
				font-size: 16px;
				font-style: italic;
			}
			.homework {
				font-size: 16px;
			}
		</style>
	</head>
	<body>
		<h1>Описание курса PHP1</h1>
		<p>
		<span class="title">Урок 1. Введение в PHP</span><br/>
		<span class="description">Принципы работы динамических сайтов Принципы работы веб-серверов Подготовка рабочей среды Hello, world! [Практика] Базовые конструкции языка – дескрипторы, переменные, типы данных Версии языка и их различия на базовом уровне</span><br/>
		<span class="homework"><a href="lesson01/">Домашнее задание</a></span><br/>
		</p>
		<p>
		<span class="title">Урок 2. Условные блоки, ветвление функции</span><br/>
		<span class="description">Принципы ветвления, визуализация, блок-схемы Операторы if, if-else Оператор switch Тернарный оператор Реализация схем логики ветвления Тернарный оператор Функции, рекурсия Использование функций и рекурсии для решения задач Области видимости переменных</span><br/>
		<span class="homework"><a href="lesson02/">Домашнее задание</a></span><br/>
		</p>
		<p>
		<span class="title">Урок 3. Циклы и массивы</span><br/>
		<span class="description">Понятие цикла, типы циклов в PHP While, do…while For Бесконечный цикл и выход из шагов, цикла Понятие массива, типы массивов в PHP Применение циклов для работы с массивами [Практика] Многомерные массивы Основные функции работы с массивами Применение функции для работы с массивами [Практика] Предопределённые массивы</span><br/>
		<span class="homework"><a href="lesson03/">Домашнее задание</a></span><br/>
		</p>
		<p>
		<span class="title">Урок 4. Работа с файлами</span><br/>
		<span class="description">Файловая система и адресация, примеры на базе разных ОС Подключение файлов с кодом Базовые операции работы с файлами – чтение, запись. Использование базовых операций для решения повседневных задач – логирование, чтение данных, кэширование [Практика] Типовые форматы хранения данных</span><br/>
		<span class="homework"><a href="lesson04/">Домашнее задание</a></span><br/>
		</p>
		<p>
		<span class="title">Урок 5. Базы данных MySQL и работа с ними на уровне PHP</span><br/>
		<span class="description">Создание БД, пользователей Создание таблиц Синтаксис базовых запросов. Создаем, редактируем и удаляем таблицы, Изучаем 4 главных команды: INSERT, UPDATE, DELETE, SELECT Выборка из БД и вывод на экран</span><br/>
		</p>
		<p>
		<span class="title">Урок 6. Интерактивность: Методы передачи данных GET и POST, работа с формами и пользовательскими данными</span><br/>
		<span class="description">Основные методы передачи данных на сервер Методы GET и POST Передача данных из формы в скрипт Обработка и сохранение данных в БД, обеспечение безопасности. Реализация CRUD-пакета действий [Практика] Загрузка файлов на сервер</span><br/>
		</p>
		<p>
		<span class="title">Урок 7. Авторизация и аутентификация</span><br/>
		<span class="description">Знакомство с понятиями авторизации и аутентификации Сессии и Cookies Шифрование пользовательских данных Реализации аутентификации пользователя на сайте</span><br/>
		</p>
		<p>
		<span class="title">Урок 8. Практика</span><br/>
		<span class="description">Написание недостающей логики страниц Создание тестовых заказов Тестирование</span><br/>
		</p>
	</body>
</html>